# HermiteSplineTangents Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
HermiteSplineTangents Constructor
HermiteSplineTangents Class See Also
---
Constructs a new default instance of the class, with tangent vectors uninitialized.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public HermiteSplineTangents()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
HermiteSplineTangents()
```

# See Also
HermiteSplineTangents Class
Autodesk.Revit.DB Namespace